In [5]:
import pandas as pd

# Load the dataset
df = pd.read_csv("Titanic-Dataset.csv")

#2.	Display basic info: .head()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
#2.	Display basic info: .describe(), .info().


df.describe()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [1]:
import pandas as pd

df = pd.read_csv("Titanic-Dataset.csv")

# Count missing values per column
print(df.isna().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
import pandas as pd

# Load dataset
df = pd.read_csv("Titanic-Dataset.csv")

# Check missing values BEFORE any operation
print("Missing values BEFORE handling:")
print(df.isna().sum())

# Fill missing Age values with 0
df["Age"] = df["Age"].fillna(0)

print("\nMissing Age values AFTER fillna:")
print(df["Age"].isna().sum())

# Drop rows where ANY column still has missing values
df = df.dropna()

print("\nMissing values AFTER dropna:")
print(df.isna().sum())

# Dataset shape after cleaning
print("\nDataset shape after fillna + dropna:")
print(df.shape)

# Preview cleaned data
print("\nFirst 5 rows of cleaned dataset:")
print(df.head())

Missing values BEFORE handling:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Missing Age values AFTER fillna:
0

Missing values AFTER dropna:
PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

Dataset shape after fillna + dropna:
(202, 12)

First 5 rows of cleaned dataset:
    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
10           11         1       3
11           12         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
10                    Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
10      1   PP 9549  16.7000    G6        S
11      0    113783  26.5500  C103        S

In [13]:
#imputation technique
import pandas as pd
import numpy as np

# Load dataset
df = pd.read_csv("Titanic-Dataset.csv")

# Separate known and missing Age values
age = df["Age"].dropna()
missing_age = df["Age"].isna()

# Print known Age values (sample)
print("Known Age values (first 10):")
print(age.head(10))

print("\nNumber of missing Age values:")
print(missing_age.sum())

# Randomly sample existing values
random_ages = np.random.choice(age,size=missing_age.sum(),replace=True)

print("\nRandomly generated Age values for imputation (first 10):")
print(random_ages[:10])



# Impute missing values
df.loc[missing_age, "Age"] = random_ages
# Verify imputation
print("\nMissing Age values AFTER imputation:")
print(df["Age"].isna().sum())

print("\nUpdated Age column (first 10 rows):")
print(df["Age"].head(10))

Known Age values (first 10):
0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
Name: Age, dtype: float64

Number of missing Age values:
177

Randomly generated Age values for imputation (first 10):
[24.  45.5  9.  26.  34.  29.  16.  31.  28.  22. ]

Missing Age values AFTER imputation:
0

Updated Age column (first 10 rows):
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    24.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [ ]:
#4.	Fix data types (convert to numeric, datetime, category).
import pandas as pd

# Load dataset
df = pd.read_csv("Titanic-Dataset.csv")

print("=== Original Data Types ===")
print(df.dtypes)

#Convert to Numeric
df["Age"] = pd.to_numeric(df["Age"], errors="coerce")#errors=coerce:force invalid data into NaN
df["Fare"] = pd.to_numeric(df["Fare"], errors="coerce")

# Convert to Datetime
# (Example: create a dummy date column)
df["Sample_Date"] = pd.to_datetime("2024-01-01")

#  Convert to Category
df["Sex"] = df["Sex"].astype("category")
df["Embarked"] = df["Embarked"].astype("category")
df["Pclass"] = df["Pclass"].astype("category")

# Display Updated Data Types
print("\n=== Updated Data Types ===")
print(df.dtypes)

# Show Sample Data
print("\n=== Sample Data (First 5 Rows) ===")
print(df.head())

=== Original Data Types ===
PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

=== Updated Data Types ===
PassengerId             int64
Survived                int64
Pclass               category
Name                   object
Sex                  category
Age                   float64
SibSp                   int64
Parch                   int64
Ticket                 object
Fare                  float64
Cabin                  object
Embarked             category
Sample_Date    datetime64[ns]
dtype: object

=== Sample Data (First 5 Rows) ===
   PassengerId  Survived Pclass  \
0            1         0      3
1            2         1      1
2            3         1      3
3            4         1      1
4            5         0      3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked Sample_Date
0      0         A/5 21171   7.2500   NaN        S  2024-01-01
1      0          PC 17599  71.2833   C85        C  2024-01-01
2      0  STON/O2. 3101282   7.9250   NaN        S  2024-01-01
3      0            113803  53.1000  C123        S  2024-01-01
4      0            373450   8.0500   NaN        S  2024-01-01

In [1]:
#Remove duplicates if present.
import pandas as pd

# Load dataset
df = pd.read_csv("Titanic-Dataset.csv")
# Check duplicate rows BEFORE removal
print("Duplicate rows BEFORE removal:")
print(df.duplicated().sum())

# Remove duplicate rows
df = df.drop_duplicates()

# Check duplicate rows AFTER removal
print("\nDuplicate rows AFTER removal:")
print(df.duplicated().sum())

# Dataset shape after removing duplicates
print("\nDataset shape after removing duplicates:")
print(df.shape)

# Preview cleaned data
print("\nFirst 5 rows after duplicate removal:")
print(df.head())

Duplicate rows BEFORE removal:
0

Duplicate rows AFTER removal:
0

Dataset shape after removing duplicates:
(891, 12)

First 5 rows after duplicate removal:
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S